# Task Exercise 4.9 - Book 4. Customer dataframe converted to pickle

# This script contains the following points:


## 1. Convert the customer dataframe to pickle

In [1]:
# Import panda, numpy, os libraries

import pandas as pd
import numpy as np
import os

## 1. Convert the customer and orders_products_merged DataFrames to terality

In [2]:
path = r'C:\Users\howl6\OneDrive\Certificates\CareerFoundry\Coursework\Data_Immersion\Chapter 4\Instacart Basket Analysis'

In [4]:
# Import customers_checked dataframe

df_cust = pd.read_csv(os.path.join(path,'02_Data','Prepared_Data', 'CSV_files', 'customers_checked.csv'), index_col=False)

In [5]:
# view top 5 rows

df_cust.head()

,Unnamed: 0,user_id,first_name,surname,gender,state,age,date_joined,num_of_dependants,family_status,income
0,0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# view number of rows, columns 

df_cust.shape

(206209, 11)

In [5]:
# convert to pickle

df_cust.to_pickle(os.path.join(path, '02_Data','Prepared_Data', 'cust_chck.pkl')

In [7]:
df_cus = pd.read_pickle(os.path.join(path,'02_Data','Prepared_Data', 'cust_chck.pkl'))

In [8]:
df_cus.head()

,Unnamed: 0,user_id,first_name,surname,gender,state,age,date_joined,num_of_dependants,family_status,income
0,0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# Drop Unnamed column

df_cus = df_cus.drop (columns = ['Unnamed: 0'])

In [10]:
# Data types

df_cus.dtypes

user_id               int64
first_name           object
surname              object
gender               object
state                object
age                   int64
date_joined          object
num_of_dependants     int64
family_status        object
income                int64
dtype: object

In [11]:
df_cus.tail()

,user_id,first_name,surname,gender,state,age,date_joined,num_of_dependants,family_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [12]:
# Convert user_id to object to align with orders_products_merged user_id column

df_cus['user_id'] = df_cust['user_id'].astype('str')

In [13]:
df_cus.dtypes

user_id              object
first_name           object
surname              object
gender               object
state                object
age                   int64
date_joined          object
num_of_dependants     int64
family_status        object
income                int64
dtype: object

In [15]:
df_cus.to_pickle(os.path.join(path, '02_Data','Prepared_Data', 'cust_chck.pkl'))